; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v8 ?v4)
             (pred_8 ?v11 ?v9)
             (pred_1 ?v8 ?v9)
             (pred_9 ?v2 ?v8 )
	     (pred_5 ?v8)
             (pred_7 ?v10)
             (pred_12 ?v11)
             (pred_3 ?v9)
             (pred_10 ?v8)
             (pred_11 ?v11)
             (pred_2 ?v8)
             (pred_4 ))



(:action op_2
:parameters (?v13 ?v7 ?v1 ?v6)
:precondition (and (pred_7 ?v13) (pred_7 ?v7) (pred_12 ?v1) (pred_3 ?v6)
          (pred_6 ?v13 ?v7) (pred_8 ?v1 ?v6)
                   (pred_1 ?v7 ?v6) (pred_5 ?v13) 
                   (pred_10 ?v7) (pred_11 ?v1))
:effect (and  (pred_2 ?v7) (not (pred_10 ?v7))))


(:action op_1
:parameters (?v13 ?v3)
:precondition (and (pred_7 ?v13) (pred_7 ?v3)
               (pred_5 ?v13) (pred_6 ?v13 ?v3) (pred_2 ?v3))
:effect (and (pred_5 ?v3) (not (pred_5 ?v13))))

(:action op_3
:parameters (?v13 ?v1)
:precondition (and (pred_7 ?v13) (pred_12 ?v1) 
                  (pred_5 ?v13) (pred_9 ?v1 ?v13) (pred_4 ))
:effect (and (pred_11 ?v1)
   (not (pred_9 ?v1 ?v13)) (not (pred_4 ))))


(:action op_4
:parameters (?v13 ?v5 ?v12)
:precondition (and (pred_7 ?v13) (pred_12 ?v5) (pred_12 ?v12)
                  (pred_5 ?v13) (pred_11 ?v12) (pred_9 ?v5 ?v13))
:effect (and (pred_11 ?v5) (pred_9 ?v12 ?v13)
        (not (pred_11 ?v12)) (not (pred_9 ?v5 ?v13))))

(:action op_5
:parameters (?v13 ?v1)
:precondition (and (pred_7 ?v13) (pred_12 ?v1) 
                  (pred_5 ?v13) (pred_11 ?v1))
:effect (and (pred_4 ) (pred_9 ?v1 ?v13) (not (pred_11 ?v1)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_26 obj_24 obj_29 obj_07 obj_22 obj_20 obj_02 obj_08 obj_18 obj_23 obj_15 obj_13 obj_10 obj_31 obj_12 obj_01 obj_27 obj_16 obj_21 obj_06 obj_11 obj_03 obj_17 obj_30
    obj_14 obj_09 obj_25
    obj_05 obj_28 obj_19
    )

    (:init
       (pred_4)

       (pred_7 obj_04)
       (pred_7 obj_26)
       (pred_7 obj_24)
       (pred_7 obj_29)
       (pred_7 obj_07)
       (pred_7 obj_22)
       (pred_7 obj_20)
       (pred_7 obj_02)
       (pred_7 obj_08)
       (pred_7 obj_18)
       (pred_7 obj_23)
       (pred_7 obj_15)
       (pred_7 obj_13)
       (pred_7 obj_10)
       (pred_7 obj_31)
       (pred_7 obj_12)
       (pred_7 obj_01)
       (pred_7 obj_27)
       (pred_7 obj_16)
       (pred_7 obj_21)
       (pred_7 obj_06)
       (pred_7 obj_11)
       (pred_7 obj_03)
       (pred_7 obj_17)
       (pred_7 obj_30)
       (pred_3 obj_14)
       (pred_3 obj_09)
       (pred_3 obj_25)
       (pred_12 obj_05)
       (pred_12 obj_28)
       (pred_12 obj_19)

       (pred_6 obj_04 obj_22)
       (pred_6 obj_04 obj_26)
       (pred_6 obj_26 obj_20)
       (pred_6 obj_26 obj_24)
       (pred_6 obj_26 obj_04)
       (pred_6 obj_24 obj_02)
       (pred_6 obj_24 obj_29)
       (pred_6 obj_24 obj_26)
       (pred_6 obj_29 obj_08)
       (pred_6 obj_29 obj_07)
       (pred_6 obj_29 obj_24)
       (pred_6 obj_07 obj_18)
       (pred_6 obj_07 obj_29)
       (pred_6 obj_22 obj_23)
       (pred_6 obj_22 obj_20)
       (pred_6 obj_22 obj_04)
       (pred_6 obj_20 obj_15)
       (pred_6 obj_20 obj_02)
       (pred_6 obj_20 obj_26)
       (pred_6 obj_20 obj_22)
       (pred_6 obj_02 obj_13)
       (pred_6 obj_02 obj_08)
       (pred_6 obj_02 obj_24)
       (pred_6 obj_02 obj_20)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_08 obj_18)
       (pred_6 obj_08 obj_29)
       (pred_6 obj_08 obj_02)
       (pred_6 obj_18 obj_31)
       (pred_6 obj_18 obj_07)
       (pred_6 obj_18 obj_08)
       (pred_6 obj_23 obj_12)
       (pred_6 obj_23 obj_15)
       (pred_6 obj_23 obj_22)
       (pred_6 obj_15 obj_01)
       (pred_6 obj_15 obj_13)
       (pred_6 obj_15 obj_20)
       (pred_6 obj_15 obj_23)
       (pred_6 obj_13 obj_27)
       (pred_6 obj_13 obj_10)
       (pred_6 obj_13 obj_02)
       (pred_6 obj_13 obj_15)
       (pred_6 obj_10 obj_16)
       (pred_6 obj_10 obj_31)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_10 obj_13)
       (pred_6 obj_31 obj_21)
       (pred_6 obj_31 obj_18)
       (pred_6 obj_31 obj_10)
       (pred_6 obj_12 obj_06)
       (pred_6 obj_12 obj_01)
       (pred_6 obj_12 obj_23)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_01 obj_27)
       (pred_6 obj_01 obj_15)
       (pred_6 obj_01 obj_12)
       (pred_6 obj_27 obj_03)
       (pred_6 obj_27 obj_16)
       (pred_6 obj_27 obj_13)
       (pred_6 obj_27 obj_01)
       (pred_6 obj_16 obj_17)
       (pred_6 obj_16 obj_21)
       (pred_6 obj_16 obj_10)
       (pred_6 obj_16 obj_27)
       (pred_6 obj_21 obj_30)
       (pred_6 obj_21 obj_31)
       (pred_6 obj_21 obj_16)
       (pred_6 obj_06 obj_11)
       (pred_6 obj_06 obj_12)
       (pred_6 obj_11 obj_03)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_11 obj_06)
       (pred_6 obj_03 obj_17)
       (pred_6 obj_03 obj_27)
       (pred_6 obj_03 obj_11)
       (pred_6 obj_17 obj_30)
       (pred_6 obj_17 obj_16)
       (pred_6 obj_17 obj_03)
       (pred_6 obj_30 obj_21)
       (pred_6 obj_30 obj_17)
       (pred_10 obj_10)
       (pred_10 obj_11)
       (pred_10 obj_17)
       (pred_1  obj_10 obj_14)
       (pred_1  obj_11 obj_09)
       (pred_1  obj_17 obj_25)
       (pred_2 obj_04)
       (pred_2 obj_26)
       (pred_2 obj_24)
       (pred_2 obj_29)
       (pred_2 obj_07)
       (pred_2 obj_22)
       (pred_2 obj_20)
       (pred_2 obj_02)
       (pred_2 obj_08)
       (pred_2 obj_18)
       (pred_2 obj_23)
       (pred_2 obj_15)
       (pred_2 obj_13)
       (pred_2 obj_31)
       (pred_2 obj_12)
       (pred_2 obj_01)
       (pred_2 obj_27)
       (pred_2 obj_16)
       (pred_2 obj_21)
       (pred_2 obj_06)
       (pred_2 obj_03)
       (pred_2 obj_30)

       (pred_8  obj_05 obj_14)
       (pred_8  obj_28 obj_09)
       (pred_8  obj_19 obj_25)
       (pred_9 obj_05 obj_15)
       (pred_9 obj_28 obj_21)
       (pred_9 obj_19 obj_07)
       (pred_5 obj_02)
    )

    (:goal (and
       (pred_9 obj_05 obj_13)
       (pred_9 obj_28 obj_16)
    ))
(:constraints
  (always (not (pred_5 obj_27)))
)
)

; plan
1. (op_1 obj_02 obj_13)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_13)
   goals met: 0 of 2
2. (op_1 obj_13 obj_15)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_15)
   goals met: 0 of 2
3. (op_3 obj_15 obj_05)
   deleted: (pred_9 obj_05 obj_15) (pred_4)
   added: (pred_11 obj_05)
   goals met: 0 of 2
4. (op_1 obj_15 obj_13)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_13)
   goals met: 0 of 2
5. (op_2 obj_13 obj_10 obj_05 obj_14)
   deleted: (pred_10 obj_10)
   added: (pred_2 obj_10)
   goals met: 0 of 2
6. (op_5 obj_13 obj_05)
   deleted: (pred_11 obj_05)
   added: (pred_4) (pred_9 obj_05 obj_13)
   goals met: 1 of 2
7. (op_1 obj_13 obj_10)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_10)
   goals met: 1 of 2
8. (op_1 obj_10 obj_16)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_16)
   goals met: 1 of 2
9. (op_1 obj_16 obj_21)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_21)
   goals met: 1 of 2
10. (op_3 obj_21 obj_28)
   deleted: (pred_9 obj_28 obj_21) (pred_4)
   added: (pred_11 obj_28)
   goals met: 1 of 2
11. (op_1 obj_21 obj_16)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_16)
   goals met: 1 of 2
12. (op_5 obj_16 obj_28)
   deleted: (pred_11 obj_28)
   added: (pred_4) (pred_9 obj_28 obj_16)
   goals met: 2 of 2
